Tekla.Structures.Drawing.DimensionSetBase
The DimensionSetBase class is the common base class for all the different dimension sets.
The dimension set base cannot be instantiated.

Tekla.Structures.Drawing.DimensionSetBase.Attributes
The dimension set attributes.

Tekla.Structures.Drawing.DimensionSetBase.DimensionSetBuffer
A buffer for holding added dimension sets. When a dimension set is modified, these dimension sets are combined to it.

Tekla.Structures.Drawing.DimensionSetBase.GetObjects
Gets the children straight dimensions of the current straight dimension set.
Returns: The children straight dimensions of the current straight dimension set.

Tekla.Structures.Drawing.DimensionSetBase.GetObjects(System.Type[])
Gets the children straight dimensions of the current straight dimension set that are of certain types.
TypeFilter: The types of the objects to get.
Returns: The children straight dimensions of the current straight dimension set that are of certain types.

Tekla.Structures.Drawing.DimensionSetBase.AddToDimensionSet(Tekla.Structures.Drawing.DimensionSetBase)
Adds a dimension set to the current dimension set.
SetToAdd: The dimension set to be added.
Returns: True on success.

Tekla.Structures.Drawing.DimensionSetBase.QueryOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum)
An interface for calling core functions. New query types are added to DrawingObject.
QueryType: The type of the query. See more details from DrawingObject.
Returns: True on success.

Tekla.Structures.Drawing.DimensionSetBase.Hideable
Accesses the information if this object is hidden or not or if it should be.